In [2]:
import pandas as pd
df = pd.read_csv("csv_file.csv")
df.head

<bound method NDFrame.head of                 Name  Age   Department  Salary
0           John Doe   28  Engineering   75000
1         Jane Smith   34    Marketing   82000
2      Michael Brown   45        Sales   68000
3        Emily Davis   30  Engineering   79000
4       Chris Wilson   25           HR   55000
5      Sarah Johnson   31    Marketing   81000
6          David Lee   40        Sales   72000
7     Jessica Taylor   29  Engineering   77000
8       Daniel White   36           HR   60000
9       Laura Martin   33    Marketing   85000
10     Robert Harris   42  Engineering   90000
11       Linda Clark   27        Sales   65000
12       Kevin Lewis   35  Engineering   83000
13   Maria Rodriguez   32           HR   62000
14      James Walker   38    Marketing   88000
15     Patricia Hall   26        Sales   63000
16     William Young   39  Engineering   86000
17    Jennifer Allen   31    Marketing   79000
18      Michael King   44        Sales   71000
19  Elizabeth Wright   30           HR   58000>

WHAT IS THE AVERAGE SALARY ?

In [5]:
df['Salary'].mean()

np.float64(73950.0)

The average salary of employees is 73950.0

In [8]:
df['Salary'].max()

90000

In [10]:
df['Salary'].min()

55000

The salary ranges from 55000 to 90000

In [12]:
df['Department'].value_counts()

Department
Engineering    6
Marketing      5
Sales          5
HR             4
Name: count, dtype: int64

the numbers of employee belongs to engineering department

In [14]:
df[df['Salary']>df['Salary'].mean()]

              Name  Age   Department  Salary
0         John Doe   28  Engineering   75000
1       Jane Smith   34    Marketing   82000
3      Emily Davis   30  Engineering   79000
5    Sarah Johnson   31    Marketing   81000
7   Jessica Taylor   29  Engineering   77000
9     Laura Martin   33    Marketing   85000
10   Robert Harris   42  Engineering   90000
12     Kevin Lewis   35  Engineering   83000
14    James Walker   38    Marketing   88000
16   William Young   39  Engineering   86000
17  Jennifer Allen   31    Marketing   79000

11 employees earn above the average salary